[Killed] BlockStatement
src/api/RateLimiter.ts:39:68
    * @param maxRequests - Maximum requests per window (default: 100)
    * @param windowMs - Time window in milliseconds (default: 60000)
    */
-  constructor(maxRequests: number = 100, windowMs: number = 60000) {
-    this.maxRequests = this.ValidateMaxRequests(maxRequests);
-    this.windowMs = this.ValidateWindowMs(windowMs);
-    this.clients = new Map();
-  }
+  constructor(maxRequests: number = 100, windowMs: number = 60000) {}
 
   /**
killedBy: RateLimiter Constructor rejects invalid max requests
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] BlockStatement
src/api/RateLimiter.ts:52:60
    * @returns Validated max requests
    * @throws Error if value is invalid
    */
-  private ValidateMaxRequests(maxRequests: number): number {
-    if (maxRequests <= 0 || !Number.isInteger(maxRequests)) {
-      throw new Error('maxRequests must be a positive integer');
-    }
-    return maxRequests;
-  }
+  private ValidateMaxRequests(maxRequests: number): number {}
 
   /**
killedBy: RateLimiter Constructor rejects invalid max requests
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] BlockStatement
src/api/RateLimiter.ts:53:61
    * @throws Error if value is invalid
    */
   private ValidateMaxRequests(maxRequests: number): number {
-    if (maxRequests <= 0 || !Number.isInteger(maxRequests)) {
-      throw new Error('maxRequests must be a positive integer');
-    }
+    if (maxRequests <= 0 || !Number.isInteger(maxRequests)) {}
     return maxRequests;
   }
killedBy: RateLimiter Constructor rejects invalid max requests
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] BooleanLiteral
src/api/RateLimiter.ts:53:29
    * @throws Error if value is invalid
    */
   private ValidateMaxRequests(maxRequests: number): number {
-    if (maxRequests <= 0 || !Number.isInteger(maxRequests)) {
+    if (maxRequests <= 0 || Number.isInteger(maxRequests)) {
       throw new Error('maxRequests must be a positive integer');
     }
killedBy: RateLimiter Constructor instantiates RateLimiter with defaults
statusReason: Error: maxRequests must be a positive integer

[Survived] StringLiteral
src/api/RateLimiter.ts:54:23
    */
   private ValidateMaxRequests(maxRequests: number): number {
     if (maxRequests <= 0 || !Number.isInteger(maxRequests)) {
-      throw new Error('maxRequests must be a positive integer');
+      throw new Error("");
     }
     return maxRequests;

[Killed] BlockStatement
src/api/RateLimiter.ts:66:54
    * @returns Validated window size
    * @throws Error if value is invalid
    */
-  private ValidateWindowMs(windowMs: number): number {
-    if (windowMs <= 0 || !Number.isInteger(windowMs)) {
-      throw new Error('windowMs must be a positive integer');
-    }
-    return windowMs;
-  }
+  private ValidateWindowMs(windowMs: number): number {}
 
   /**
killedBy: RateLimiter Constructor rejects invalid window size
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] BooleanLiteral
src/api/RateLimiter.ts:67:26
    * @throws Error if value is invalid
    */
   private ValidateWindowMs(windowMs: number): number {
-    if (windowMs <= 0 || !Number.isInteger(windowMs)) {
+    if (windowMs <= 0 || Number.isInteger(windowMs)) {
       throw new Error('windowMs must be a positive integer');
     }
killedBy: RateLimiter Constructor instantiates RateLimiter with defaults
statusReason: Error: windowMs must be a positive integer

[Killed] ConditionalExpression
src/api/RateLimiter.ts:67:9
    * @throws Error if value is invalid
    */
   private ValidateWindowMs(windowMs: number): number {
-    if (windowMs <= 0 || !Number.isInteger(windowMs)) {
+    if (true) {
       throw new Error('windowMs must be a positive integer');
     }
killedBy: RateLimiter Constructor instantiates RateLimiter with defaults
statusReason: Error: windowMs must be a positive integer

[Killed] BlockStatement
src/api/RateLimiter.ts:79:55
    * @param clientId - Unique client identifier
    * @returns Rate limit result with allowed status
    */
-  public IsAllowed(clientId: string): RateLimitResult {
-    const normalizedId = this.NormalizeClientId(clientId);
-    const now = Date.now();
-
-    const entry = this.GetOrCreateClientEntry(normalizedId, now);
-
-    // Check if window has expired
-    if (now - entry.windowStart > this.windowMs) {
-      entry.count = 0;
-      entry.windowStart = now;
-    }
-
-    // Check if limit exceeded
-    if (entry.count >= this.maxRequests) {
-      const retryAfter = Math.ceil(
-        (entry.windowStart + this.windowMs - now) / 1000
-      );
-      return { allowed: false, retryAfter };
-    }
-
-    // Increment counter and allow
-    entry.count++;
-    return { allowed: true };
-  }
+  public IsAllowed(clientId: string): RateLimitResult {}
 
   /**
killedBy: RateLimiter IsAllowed Method allows request under threshold
statusReason: TypeError: Cannot read properties of undefined (reading 'allowed')

[Killed] ArithmeticOperator
src/api/RateLimiter.ts:86:9
     const entry = this.GetOrCreateClientEntry(normalizedId, now);
 
     // Check if window has expired
-    if (now - entry.windowStart > this.windowMs) {
+    if (now + entry.windowStart > this.windowMs) {
       entry.count = 0;
       entry.windowStart = now;
killedBy: RateLimiter IsAllowed Method denies request after threshold exceeded
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/api/RateLimiter.ts:86:9
     const entry = this.GetOrCreateClientEntry(normalizedId, now);
 
     // Check if window has expired
-    if (now - entry.windowStart > this.windowMs) {
+    if (true) {
       entry.count = 0;
       entry.windowStart = now;
killedBy: RateLimiter IsAllowed Method denies request after threshold exceeded
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/api/RateLimiter.ts:92:9
     }
 
     // Check if limit exceeded
-    if (entry.count >= this.maxRequests) {
+    if (false) {
       const retryAfter = Math.ceil(
         (entry.windowStart + this.windowMs - now) / 1000
killedBy: RateLimiter IsAllowed Method denies request after threshold exceeded
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/api/RateLimiter.ts:92:9
     }
 
     // Check if limit exceeded
-    if (entry.count >= this.maxRequests) {
+    if (true) {
       const retryAfter = Math.ceil(
         (entry.windowStart + this.windowMs - now) / 1000
killedBy: RateLimiter IsAllowed Method allows request under threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArithmeticOperator
src/api/RateLimiter.ts:94:10
     // Check if limit exceeded
     if (entry.count >= this.maxRequests) {
       const retryAfter = Math.ceil(
-        (entry.windowStart + this.windowMs - now) / 1000
+        (entry.windowStart + this.windowMs + now) / 1000
       );
       return { allowed: false, retryAfter };
killedBy: RateLimiter IsAllowed Method returns accurate retryAfter time
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 1000
Received:    3551381640

[Killed] ArithmeticOperator
src/api/RateLimiter.ts:94:9
     // Check if limit exceeded
     if (entry.count >= this.maxRequests) {
       const retryAfter = Math.ceil(
-        (entry.windowStart + this.windowMs - now) / 1000
+        (entry.windowStart + this.windowMs - now) * 1000
       );
       return { allowed: false, retryAfter };
killedBy: RateLimiter IsAllowed Method returns accurate retryAfter time
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 1000
Received:    1000000

[Killed] BooleanLiteral
src/api/RateLimiter.ts:96:25
       const retryAfter = Math.ceil(
         (entry.windowStart + this.windowMs - now) / 1000
       );
-      return { allowed: false, retryAfter };
+      return { allowed: true, retryAfter };
     }
 
killedBy: RateLimiter IsAllowed Method denies request after threshold exceeded
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] UpdateOperator
src/api/RateLimiter.ts:100:5
     }
 
     // Increment counter and allow
-    entry.count++;
+    entry.count--;
     return { allowed: true };
   }
killedBy: RateLimiter IsAllowed Method denies request after threshold exceeded
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/api/RateLimiter.ts:101:23
 
     // Increment counter and allow
     entry.count++;
-    return { allowed: true };
+    return { allowed: false };
   }
 
killedBy: RateLimiter IsAllowed Method allows request under threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/api/RateLimiter.ts:110:74
    * @param clientId - Raw client ID
    * @returns Normalized client ID
    */
-  private NormalizeClientId(clientId: string | null | undefined): string {
-    if (!clientId || clientId === null || clientId === undefined) {
-      return 'anonymous';
-    }
-    return String(clientId);
-  }
+  private NormalizeClientId(clientId: string | null | undefined): string {}
 
   /**
killedBy: RateLimiter Rate Limiting Behavior handles concurrent clients without interference
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/api/RateLimiter.ts:111:9
    * @returns Normalized client ID
    */
   private NormalizeClientId(clientId: string | null | undefined): string {
-    if (!clientId || clientId === null || clientId === undefined) {
+    if (true) {
       return 'anonymous';
     }
killedBy: RateLimiter Rate Limiting Behavior handles concurrent clients without interference
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
src/api/RateLimiter.ts:111:9
    * @returns Normalized client ID
    */
   private NormalizeClientId(clientId: string | null | undefined): string {
-    if (!clientId || clientId === null || clientId === undefined) {
+    if (clientId || clientId === null || clientId === undefined) {
       return 'anonymous';
     }
killedBy: RateLimiter Rate Limiting Behavior handles concurrent clients without interference
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] StringLiteral
src/api/RateLimiter.ts:112:14
    */
   private NormalizeClientId(clientId: string | null | undefined): string {
     if (!clientId || clientId === null || clientId === undefined) {
-      return 'anonymous';
+      return "";
     }
     return String(clientId);

[Killed] BlockStatement
src/api/RateLimiter.ts:127:18
   private GetOrCreateClientEntry(
     clientId: string,
     now: number
-  ): ClientEntry {
-    const existing = this.clients.get(clientId);
-    if (existing) {
-      return existing;
-    }
-
-    const entry: ClientEntry = {
-      count: 0,
-      windowStart: now,
-    };
-
-    this.clients.set(clientId, entry);
-    return entry;
-  }
+  ): ClientEntry {}
 
   /**
killedBy: RateLimiter IsAllowed Method allows request under threshold
statusReason: TypeError: Cannot read properties of undefined (reading 'windowStart')

[Killed] ConditionalExpression
src/api/RateLimiter.ts:129:9
     now: number
   ): ClientEntry {
     const existing = this.clients.get(clientId);
-    if (existing) {
+    if (false) {
       return existing;
     }
killedBy: RateLimiter IsAllowed Method denies request after threshold exceeded
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/api/RateLimiter.ts:129:19
     now: number
   ): ClientEntry {
     const existing = this.clients.get(clientId);
-    if (existing) {
-      return existing;
-    }
+    if (existing) {}
 
     const entry: ClientEntry = {
killedBy: RateLimiter IsAllowed Method denies request after threshold exceeded
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/api/RateLimiter.ts:148:52
    * @param clientId - Client identifier
    * @returns Current request count
    */
-  public GetRequestCount(clientId: string): number {
-    const normalizedId = this.NormalizeClientId(clientId);
-    const entry = this.clients.get(normalizedId);
-
-    if (!entry) {
-      return 0;
-    }
-
-    // Check if window expired
-    if (Date.now() - entry.windowStart > this.windowMs) {
-      return 0;
-    }
-
-    return entry.count;
-  }
+  public GetRequestCount(clientId: string): number {}
 
   /**
killedBy: RateLimiter GetRequestCount Method returns 0 for new client
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ConditionalExpression
src/api/RateLimiter.ts:152:9
     const normalizedId = this.NormalizeClientId(clientId);
     const entry = this.clients.get(normalizedId);
 
-    if (!entry) {
+    if (false) {
       return 0;
     }
killedBy: RateLimiter GetRequestCount Method returns 0 for new client
statusReason: TypeError: Cannot read properties of undefined (reading 'windowStart')

[Killed] BlockStatement
src/api/RateLimiter.ts:152:17
     const normalizedId = this.NormalizeClientId(clientId);
     const entry = this.clients.get(normalizedId);
 
-    if (!entry) {
-      return 0;
-    }
+    if (!entry) {}
 
     // Check if window expired
killedBy: RateLimiter GetRequestCount Method returns 0 for new client
statusReason: TypeError: Cannot read properties of undefined (reading 'windowStart')

[Killed] ConditionalExpression
src/api/RateLimiter.ts:157:9
     }
 
     // Check if window expired
-    if (Date.now() - entry.windowStart > this.windowMs) {
+    if (true) {
       return 0;
     }
killedBy: RateLimiter GetRequestCount Method returns accurate count after requests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] EqualityOperator
src/api/RateLimiter.ts:157:9
     }
 
     // Check if window expired
-    if (Date.now() - entry.windowStart > this.windowMs) {
+    if (Date.now() - entry.windowStart <= this.windowMs) {
       return 0;
     }
killedBy: RateLimiter GetRequestCount Method returns accurate count after requests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] BlockStatement
src/api/RateLimiter.ts:169:46
    *
    * @param clientId - Client identifier to reset
    */
-  public ResetClient(clientId: string): void {
-    const normalizedId = this.NormalizeClientId(clientId);
-    this.clients.delete(normalizedId);
-  }
+  public ResetClient(clientId: string): void {}
 
   /**
killedBy: RateLimiter ResetClient Method resets counter for specific client
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Survived] BlockStatement
src/api/RateLimiter.ts:177:26
   /**
    * Removes expired client entries from memory.
    */
-  public Cleanup(): void {
-    const now = Date.now();
-    const entriesToDelete: string[] = [];
-
-    this.clients.forEach((entry, clientId) => {
-      if (now - entry.windowStart > this.windowMs) {
-        entriesToDelete.push(clientId);
-      }
-    });
-
-    entriesToDelete.forEach((id) => this.clients.delete(id));
-  }
+  public Cleanup(): void {}
 
   /**

[Survived] BlockStatement
src/api/RateLimiter.ts:181:47
     const now = Date.now();
     const entriesToDelete: string[] = [];
 
-    this.clients.forEach((entry, clientId) => {
-      if (now - entry.windowStart > this.windowMs) {
-        entriesToDelete.push(clientId);
-      }
-    });
+    this.clients.forEach((entry, clientId) => {});
 
     entriesToDelete.forEach((id) => this.clients.delete(id));

[Survived] EqualityOperator
src/api/RateLimiter.ts:182:11
     const entriesToDelete: string[] = [];
 
     this.clients.forEach((entry, clientId) => {
-      if (now - entry.windowStart > this.windowMs) {
+      if (now - entry.windowStart <= this.windowMs) {
         entriesToDelete.push(clientId);
       }

[Survived] ArithmeticOperator
src/api/RateLimiter.ts:182:11
     const entriesToDelete: string[] = [];
 
     this.clients.forEach((entry, clientId) => {
-      if (now - entry.windowStart > this.windowMs) {
+      if (now + entry.windowStart > this.windowMs) {
         entriesToDelete.push(clientId);
       }

[Survived] ArrowFunction
src/api/RateLimiter.ts:187:29
       }
     });
 
-    entriesToDelete.forEach((id) => this.clients.delete(id));
+    entriesToDelete.forEach(() => undefined);
   }
 

[Killed] BlockStatement
src/api/RateLimiter.ts:196:57
    * @param clientId - Client identifier
    * @returns HTTP rate limit headers
    */
-  public GetHeaders(clientId: string): RateLimitHeaders {
-    const count = this.GetRequestCount(clientId);
-    const remaining = Math.max(0, this.maxRequests - count);
-    const reset = Math.ceil((Date.now() + this.windowMs) / 1000);
-
-    return {
-      'X-RateLimit-Limit': String(this.maxRequests),
-      'X-RateLimit-Remaining': String(remaining),
-      'X-RateLimit-Reset': String(reset),
-    };
-  }
+  public GetHeaders(clientId: string): RateLimitHeaders {}
 }
 
killedBy: RateLimiter HTTP Response Headers returns rate limit headers
statusReason: TypeError: Cannot read properties of undefined (reading 'X-RateLimit-Limit')

[Killed] ArithmeticOperator
src/api/RateLimiter.ts:198:35
    */
   public GetHeaders(clientId: string): RateLimitHeaders {
     const count = this.GetRequestCount(clientId);
-    const remaining = Math.max(0, this.maxRequests - count);
+    const remaining = Math.max(0, this.maxRequests + count);
     const reset = Math.ceil((Date.now() + this.windowMs) / 1000);
 
killedBy: RateLimiter HTTP Response Headers updates remaining count after requests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "90"
Received: "110"

[Killed] MethodExpression
src/api/RateLimiter.ts:198:23
    */
   public GetHeaders(clientId: string): RateLimitHeaders {
     const count = this.GetRequestCount(clientId);
-    const remaining = Math.max(0, this.maxRequests - count);
+    const remaining = Math.min(0, this.maxRequests - count);
     const reset = Math.ceil((Date.now() + this.windowMs) / 1000);
 
killedBy: RateLimiter HTTP Response Headers returns rate limit headers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "100"
Received: "0"

[Survived] ArithmeticOperator
src/api/RateLimiter.ts:199:30
   public GetHeaders(clientId: string): RateLimitHeaders {
     const count = this.GetRequestCount(clientId);
     const remaining = Math.max(0, this.maxRequests - count);
-    const reset = Math.ceil((Date.now() + this.windowMs) / 1000);
+    const reset = Math.ceil((Date.now() - this.windowMs) / 1000);
 
     return {

[Survived] ArithmeticOperator
src/api/RateLimiter.ts:199:29
   public GetHeaders(clientId: string): RateLimitHeaders {
     const count = this.GetRequestCount(clientId);
     const remaining = Math.max(0, this.maxRequests - count);
-    const reset = Math.ceil((Date.now() + this.windowMs) / 1000);
+    const reset = Math.ceil((Date.now() + this.windowMs) * 1000);
 
     return {
