[Killed] BooleanLiteral
src/infrastructure/SignalLifecycleManager.ts:16:30
 
   constructor() {
     this.shutdownCallbacks = [];
-    this.shutdownInitiated = false;
+    this.shutdownInitiated = true;
     this.sigtermHandler = null;
     this.sigintHandler = null;
killedBy: SignalLifecycleManager Constructor initializes shutdownInitiated as false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/infrastructure/SignalLifecycleManager.ts:28:59
    * @param callback - The shutdown callback function to register
    * @public
    */
-  public RegisterShutdownHook(callback: () => void): void {
-    if (callback === null || callback === undefined) {
-      return;
-    }
-
-    this.shutdownCallbacks.push(callback);
-  }
+  public RegisterShutdownHook(callback: () => void): void {}
 
   /**
killedBy: SignalLifecycleManager RegisterShutdownHook only adds valid callbacks to execution queue
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/SignalLifecycleManager.ts:29:9
    * @public
    */
   public RegisterShutdownHook(callback: () => void): void {
-    if (callback === null || callback === undefined) {
+    if (true) {
       return;
     }
killedBy: SignalLifecycleManager RegisterShutdownHook only adds valid callbacks to execution queue
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] EqualityOperator
src/infrastructure/SignalLifecycleManager.ts:29:30
    * @public
    */
   public RegisterShutdownHook(callback: () => void): void {
-    if (callback === null || callback === undefined) {
+    if (callback === null || callback !== undefined) {
       return;
     }
killedBy: SignalLifecycleManager RegisterShutdownHook only adds valid callbacks to execution queue
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/infrastructure/SignalLifecycleManager.ts:42:33
    *
    * @public
    */
-  public StartListening(): void {
-    if (this.sigtermHandler !== null) {
-      return;
-    }
-
-    this.sigtermHandler = (): void => {
-      this.HandleShutdown();
-    };
-
-    this.sigintHandler = (): void => {
-      this.HandleShutdown();
-    };
-
-    process.on('SIGTERM', this.sigtermHandler);
-    process.on('SIGINT', this.sigintHandler);
-  }
+  public StartListening(): void {}
 
   /**
killedBy: SignalLifecycleManager RegisterShutdownHook ignores null callbacks
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/infrastructure/SignalLifecycleManager.ts:43:9
    * @public
    */
   public StartListening(): void {
-    if (this.sigtermHandler !== null) {
+    if (false) {
       return;
     }
killedBy: SignalLifecycleManager StartListening is idempotent - does not reattach handlers if called twice
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 4

[Killed] ConditionalExpression
src/infrastructure/SignalLifecycleManager.ts:43:9
    * @public
    */
   public StartListening(): void {
-    if (this.sigtermHandler !== null) {
+    if (true) {
       return;
     }
killedBy: SignalLifecycleManager RegisterShutdownHook ignores null callbacks
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/infrastructure/SignalLifecycleManager.ts:47:39
       return;
     }
 
-    this.sigtermHandler = (): void => {
-      this.HandleShutdown();
-    };
+    this.sigtermHandler = (): void => {};
 
     this.sigintHandler = (): void => {
killedBy: SignalLifecycleManager RegisterShutdownHook only adds valid callbacks to execution queue
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/infrastructure/SignalLifecycleManager.ts:51:38
       this.HandleShutdown();
     };
 
-    this.sigintHandler = (): void => {
-      this.HandleShutdown();
-    };
+    this.sigintHandler = (): void => {};
 
     process.on('SIGTERM', this.sigtermHandler);
killedBy: SignalLifecycleManager StartListening invokes registered callbacks when SIGINT is emitted
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
src/infrastructure/SignalLifecycleManager.ts:55:16
       this.HandleShutdown();
     };
 
-    process.on('SIGTERM', this.sigtermHandler);
+    process.on("", this.sigtermHandler);
     process.on('SIGINT', this.sigintHandler);
   }
killedBy: SignalLifecycleManager RegisterShutdownHook only adds valid callbacks to execution queue
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/infrastructure/SignalLifecycleManager.ts:65:34
    *
    * @private
    */
-  private HandleShutdown(): void {
-    if (this.shutdownInitiated) {
-      return;
-    }
-
-    this.shutdownInitiated = true;
-
-    for (const callback of this.shutdownCallbacks) {
-      try {
-        callback();
-      } catch (error) {
-        // eslint-disable-next-line no-console
-        console.error('Error during shutdown:', error);
-      }
-    }
-  }
+  private HandleShutdown(): void {}
 
   /**
killedBy: SignalLifecycleManager RegisterShutdownHook only adds valid callbacks to execution queue
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/infrastructure/SignalLifecycleManager.ts:66:9
    * @private
    */
   private HandleShutdown(): void {
-    if (this.shutdownInitiated) {
+    if (false) {
       return;
     }
killedBy: SignalLifecycleManager Idempotency - Multiple Rapid Signals only invokes shutdown callbacks once even with multiple SIGTERM signals
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 3

[Killed] BlockStatement
src/infrastructure/SignalLifecycleManager.ts:66:33
    * @private
    */
   private HandleShutdown(): void {
-    if (this.shutdownInitiated) {
-      return;
-    }
+    if (this.shutdownInitiated) {}
 
     this.shutdownInitiated = true;
killedBy: SignalLifecycleManager Idempotency - Multiple Rapid Signals only invokes shutdown callbacks once even with multiple SIGTERM signals
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 3

[Killed] BooleanLiteral
src/infrastructure/SignalLifecycleManager.ts:70:30
       return;
     }
 
-    this.shutdownInitiated = true;
+    this.shutdownInitiated = false;
 
     for (const callback of this.shutdownCallbacks) {
killedBy: SignalLifecycleManager Idempotency - Multiple Rapid Signals only invokes shutdown callbacks once even with multiple SIGTERM signals
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 3

[Killed] BlockStatement
src/infrastructure/SignalLifecycleManager.ts:72:52
 
     this.shutdownInitiated = true;
 
-    for (const callback of this.shutdownCallbacks) {
-      try {
-        callback();
-      } catch (error) {
-        // eslint-disable-next-line no-console
-        console.error('Error during shutdown:', error);
-      }
-    }
+    for (const callback of this.shutdownCallbacks) {}
   }
 
killedBy: SignalLifecycleManager RegisterShutdownHook only adds valid callbacks to execution queue
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/infrastructure/SignalLifecycleManager.ts:73:11
     this.shutdownInitiated = true;
 
     for (const callback of this.shutdownCallbacks) {
-      try {
-        callback();
-      } catch (error) {
+      try {} catch (error) {
         // eslint-disable-next-line no-console
         console.error('Error during shutdown:', error);
killedBy: SignalLifecycleManager RegisterShutdownHook only adds valid callbacks to execution queue
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/infrastructure/SignalLifecycleManager.ts:75:23
     for (const callback of this.shutdownCallbacks) {
       try {
         callback();
-      } catch (error) {
-        // eslint-disable-next-line no-console
-        console.error('Error during shutdown:', error);
-      }
+      } catch (error) {}
     }
   }
killedBy: SignalLifecycleManager Edge Case - Callback Throws Error logs error message when callback throws
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error during shutdown:", [Error: Test shutdown error]

Number of calls: 0

[Killed] BlockStatement
src/infrastructure/SignalLifecycleManager.ts:88:39
    * @returns boolean indicating shutdown status
    * @public
    */
-  public GetShutdownStatus(): boolean {
-    return this.shutdownInitiated;
-  }
+  public GetShutdownStatus(): boolean {}
 
   /**
killedBy: SignalLifecycleManager ResetForTesting resets shutdown state for testing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
src/infrastructure/SignalLifecycleManager.ts:98:34
    *
    * @public
    */
-  public ResetForTesting(): void {
-    this.shutdownCallbacks = [];
-    this.shutdownInitiated = false;
-    this.sigtermHandler = null;
-    this.sigintHandler = null;
-  }
+  public ResetForTesting(): void {}
 }
 
killedBy: SignalLifecycleManager ResetForTesting resets shutdown state for testing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
